1)
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| name           | varchar |
+----------------+---------+
user_id is the primary key (column with unique values) for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters

#### SQL

select user_id, concat(upper(name,1,1),lower(name,2)) as name from users order by user_id

#### Pandas

def fix(name):
    return name.capitalize()
df['name']=df['name'].apply(fix)
df.sort_values(by='user_id',inplace=True)

2)
Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix.

Return the result table in any order.

The result format is in the following example.
Input: 
Patients table:
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 1          | Daniel       | YFEV COUGH   |
| 2          | Alice        |              |
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 |
| 5          | Alain        | DIAB201      |
+------------+--------------+--------------+
Output: 
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 | 
+------------+--------------+--------------+

#### SQL

select * from Patients where conditions like 'DIAB1%' or conditions like '% DIAB1%'

#### Pandas

Case 1: When 'DIAB1' is any where then
    df[df['conditions'].str.contains('DIAB1', case=False, na=False)]
Case 2: When conditions starts with 'DIAB1' then
    df[df['conditions'].str.startswith('DIAB1')]

3)
Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.
For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.
For Pandas users, please note that you are supposed to modify Person in place.
After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.
The result format is in the following example.

Person table:
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Output: 
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+

#### SQL

WITH base AS (
    SELECT id, email, ROW_NUMBER() OVER (PARTITION BY email ORDER BY id) AS rn
    FROM Person
)
DELETE FROM Person
WHERE (email, id) IN (
    SELECT email, id
    FROM base
    WHERE rn > 1
);

#### Pandas

df.drop_duplicates(subset='email', keep='first', inplace=True)

4)
Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+

#### SQL

with base as(select salary from  Employee e1 where 2 = (select salary from Employee e2 where e2.salary>=e1.salary))
select 
case when count(*)=0 then  null
else salary
end as SecondHighestSalary
from base

#### Pandas


df['SecondHighestSalary'] = df['Salary'].nunique() >= 2 and df['Salary'].nlargest(2).iloc[-1] or None